app/controllers/blog_controller.rb

   def index
    @total= Post.count
---
SELECT count(*) AS count_all FROM `posts`

   def show
     @post = Post.find(params[:id])
     @comments= Comment.find_all_by_post_id(@post.id)
     @total= @comments.length
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 0)
SELECT * FROM `comments` WHERE (`comments`.`post_id` = 23)
SELECT * FROM `comments`
SELECT count(*) AS count_all FROM `comments`

   def categories
    @category= Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 4)

   def create_comment
     @comment = Comment.new(params[:comment])
     @comment.post_id=params[:id]
      if @comment.save
---
INSERT INTO `comments` (`name`, `created_at`, `updated_at`, `post_id`, `website`, `message`, `email`) VALUES('vijiraj', '2009-06-16 10:02:28', '2009-06-16 10:02:28', NULL, 'www.vijiraj.com', 'Determines originating IP address. REMOTE_ADDR is the standard but will fail if the user is behind a proxy. HTTP_CLIENT_IP and/or HTTP_X_FORWARDED_FOR are set by proxies so check for these if REMOTE_ADDR is a proxy. HTTP_X_FORWARDED_FOR may be a comma- delimited list in the case of multiple chained proxies; the last address which is not trusted is the originating IP. ', 'vijirajtp@yahoo.com')

  def search
    @posts = Post.find( :all, :conditions => ["title LIKE ? OR content LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%"], :order => 'created_at DESC' ) if !params[:search].blank?
---
SELECT * FROM `posts` WHERE (title LIKE '%ruby%' OR content LIKE '%ruby%') ORDER BY created_at DESC