app/controllers/home_controller.rb

INSERT INTO `contacts` (`created_at`, `updated_at`, `subject`, `telephone`, `message`, `email`) VALUES('2009-06-16 14:21:05', '2009-06-16 14:21:05', 'jjjllffcv', 7855, 'fgfhfhjgh\r\nhfhghjhhghfgh', 'support@root.com')
---
  def send_message
    @contact = Contact.new(params[:contact])
        if @contact.save