app/controllers/posts_controller.rb

  def index
    @title = "Blog"
    @total = Post.count
---
SELECT count(*) AS count_all FROM `posts`

  def create
    @title = "Create new post"
    @blog_post = Post.new(params[:blog_post])
    if @blog_post.save
---
INSERT INTO `posts` (`created_at`, `size`, `title`, `content_type`, `updated_at`, `thumbnail`, `content`, `parent_id`, `filename`, `height`, `width`) VALUES('2009-06-15 15:59:13', 134181, 'iojhjkhjk', 'image/jpeg', '2009-06-15 15:59:13', NULL, 'hjkhjkhjkjhk', NULL, 'ubuntu-dark.jpg', NULL, NULL)

   def edit
    @blog_post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 9)

  def update
    @blog_post = Post.find(params[:id])
    @title = @blog_post.title
    if @blog_post.update_attributes(params[:blog_post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 9)
UPDATE `posts` SET `content` = 'ghghghgfhgh', `updated_at` = '2009-06-12 11:41:53' WHERE `id` = 9

  def destroy
    @blog_post = Post.find(params[:id])
    if @blog_post.destroy
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
DELETE FROM `posts` WHERE `id` = 1

  def categories
    @categories = Category.find(:all)
    @category = Category.new
    @total = Category.count
---
SELECT count(*) AS count_all FROM `categories`

    def create_category
        @category = Category.new(params[:category])
        if @category.save
---
INSERT INTO `categories` (`created_at`, `category_name`, `updated_at`) VALUES('2009-06-12 16:34:53', NULL, '2009-06-12 16:34:53')

    def destroy
        @category = Category.find(params[:id])
        if @category.destroy
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
DELETE FROM `categories` WHERE `id` = 1