app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('f482a1342024fbe582df632e75e849fa05ec90cc', '2009-06-12 07:15:44', '00b1638fc09575df865b6201041c943618a2f44f', NULL, '2009-06-12 07:15:44', NULL, 'user', 'user@logicalfolks.com')